class Dictionaries:
  DensityDict = {'Метан' : 0.716, 'Этан' : 1.342, 'Пропан' : 1.969, 'Бутан' : 2.595, 'Пентан' : 3.221,
              'Гексан' : 3.842, 'Гептан' : 4.468, 'Азот' : 1.251, 'Диоксид' : 1.965, 'Сероводород' : 1.522}
  MassDict = {'Метан' : 16.043, 'Этан' : 30.07, 'Пропан' : 44.097, 'Бутан' : 58.124, 'Пентан' : 72.151,
              'Гексан' : 86.066, 'Гептан' : 100.077, 'Азот' : 28.016, 'Диоксид' : 44.011, 'Сероводород' : 34.082}
  riDict = {'Метан' : 1.00, 'Этан' : 1.87, 'Пропан' : 2.75, 'Бутан' : 3.62, 'Пентан' : 4.50,
              'Гексан' : 5.36, 'Гептан' : 6.24, 'Азот' : None, 'Диоксид' : None, 'Сероводород' : None}
  ComponentMassDict = {'Метан' : [74.87, 25.13, 0, 0, 0], 'Этан' : [79.89, 20.11, 0, 0, 0], 
                 'Пропан' : [81.71, 18.29, 0, 0, 0], 'Бутан' : [82.66, 17.34, 0, 0, 0], 
                 'Пентан' : [83.24, 16.76, 0, 0, 0], 'Гексан' : [83.73, 16.27, 0, 0, 0], 
                 'Гептан' : [84.01, 15.99, 0, 0, 0], 'Азот' : [0, 0, 100, 0, 0], 
                 'Диоксид' : [27.29, 0, 0, 72.71, 0], 'Сероводород' : [0, 5.92, 0, 0, 94.08]}
  AdiabatDict = {'Метан' : 1.31, 'Этан' : 1.21, 'Пропан' :  1.13, 'Бутан' : 1.10, 'Пентан' : 1.08,
              'Гексан' : 1.07, 'Гептан' : 1.06, 'Азот' : 1.40, 'Диоксид' : 1.30, 'Сероводород' : 1.34}
